{

"prompt_metadata": {

"prompt_id": "CCM_Trend_Report_Outlook",

"prompt_version": "1.0",

"creation_date": "YYYY-MM-DD",

"description": "A prompt to generate a comprehensive report on credit and capital market trends for the next 6-12 months.",

"author": "CRAFT"

},

"report_specifications": {

"report_title": "Credit and Capital Markets: Trends & Outlook (Next 6-12 Months)",

"time_horizon": "6-12 months from [Current Date]",

"target_audience": "Institutional Investors, Financial Analysts, Corporate Treasurers",

"output_format": "Markdown with structured sections (JSON compatible)",

"tone_and_style": "Professional, analytical, data-driven, cautiously optimistic with clear risk articulation."

},

"core_analysis_areas": [

{

"section_id": "macroeconomic_overview",

"section_title": "Global Macroeconomic Backdrop",

"instructions": "Analyze key macroeconomic factors expected to influence credit and capital markets. Consider:",

"key_considerations": [

"Global GDP growth forecasts (major economies and blocs: US, Eurozone, China, Emerging Markets).",

"Inflation trends and outlook: headline vs. core, drivers, persistence.",

"Monetary policy outlook: central bank actions (Fed, ECB, BoE, BoJ), forward guidance, quantitative easing/tightening (QE/QT) impact.",

"Fiscal policy developments in key economies and their market implications.",

"Labor market dynamics: unemployment rates, wage growth, participation rates.",

"Key geopolitical risks and their potential economic impact (e.g., ongoing conflicts, trade tensions, elections)."

]

},

{

"section_id": "credit_market_trends",

"section_title": "Credit Market Dynamics and Outlook",

"instructions": "Provide a detailed analysis of trends across major credit market segments.",

"sub_sections": [

{

"sub_section_id": "investment_grade_corporate",

"title": "Investment Grade (IG) Corporates",

"key_considerations": [

"Spread outlook and drivers (e.g., economic growth, default expectations, technicals).",

"Issuance trends: volume, use of proceeds, new issuer types.",

"Default rate forecasts and recovery rate expectations.",

"Sector-specific analysis: identifying resilient and vulnerable sectors.",

"Impact of interest rate volatility on IG bond performance.",

"Investor demand and fund flows."

]

},

{

"sub_section_id": "high_yield_corporate",

"title": "High Yield (HY) Corporates",

"key_considerations": [

"Spread outlook and drivers (risk appetite, default fears, economic sensitivity).",

"Issuance trends: quality of new issues, covenant analysis.",

"Default rate forecasts (base, bull, bear cases) and recovery rates, including distressed debt dynamics.",

"Sector-specific analysis: focusing on sectors with high leverage or cyclical exposure.",

"Liquidity conditions in the HY market.",

"Impact of refinancing walls and maturity profiles."

]

},

{

"sub_section_id": "leveraged_loans",

"title": "Leveraged Loans",

"key_considerations": [

"Market trends: CLO issuance, private credit competition.",

"Credit quality: EBITDA add-backs, covenant-lite trends.",

"Spread and yield outlook.",

"Default and recovery rate expectations.",

"Impact of floating rates in the current interest rate environment."

]

},

{

"sub_section_id": "private_credit",

"title": "Private Credit & Direct Lending",

"key_considerations": [

"Growth trajectory and market share vs. public markets.",

"Performance and return expectations (illiquidity premium).",

"Key risks: transparency, valuation methodologies, potential for correlated defaults.",

"Fundraising environment and dry powder levels.",

"Regulatory scrutiny and developments."

]

},

{

"sub_section_id": "municipal_bonds",

"title": "Municipal Bonds (US Focus, if applicable)",

"key_considerations": [

"Credit quality trends across states and sectors (e.g., GO vs. Revenue bonds).",

"Impact of federal policies and infrastructure spending.",

"Tax policy implications.",

"Investor demand, particularly from retail and SMAs."

]

},

{

"sub_section_id": "structured_credit",

"title": "Structured Credit (e.g., ABS, CMBS, CLOs)",

"key_considerations": [

"Performance outlook for key segments based on underlying collateral quality (e.g., consumer credit for ABS, commercial real estate for CMBS).",

"Issuance trends and investor appetite.",

"Impact of economic conditions on delinquency and default rates in underlying assets.",

"Regulatory changes affecting structured products."

]

}

]

},

{

"section_id": "capital_market_trends",

"section_title": "Capital Market Activity and Outlook",

"instructions": "Analyze trends in equity and other capital raising activities.",

"sub_sections": [

{

"sub_section_id": "equity_markets",

"title": "Equity Markets",

"key_considerations": [

"Overall market outlook: key index target levels (S&P 500, Nasdaq, etc.), valuation analysis (P/E ratios, ERP).",

"Earnings growth expectations and corporate profitability trends.",

"Sector rotation and leadership themes.",

"Impact of interest rates and inflation on equity valuations.",

"Investor sentiment and fund flows.",

"Volatility outlook (e.g., VIX levels)."

]

},

{

"sub_section_id": "ipo_market",

"title": "Initial Public Offerings (IPOs)",

"key_considerations": [

"IPO window outlook: conditions favoring or hindering new listings.",

"Expected issuance volume and key sectors for IPO activity.",

"Performance of recent IPOs and aftermarket trends.",

"Impact of SPACs and direct listings, if still relevant."

]

},

{

"sub_section_id": "secondary_offerings_buybacks",

"title": "Secondary Offerings & Share Buybacks",

"key_considerations": [

"Trends in secondary equity offerings.",

"Pace and volume of corporate share repurchase programs and their market impact."

]

},

{

"sub_section_id": "ma_activity",

"title": "Mergers & Acquisitions (M&A)",

"key_considerations": [

"Outlook for M&A volume and deal sizes.",

"Key drivers: strategic imperatives, private equity activity, financing conditions.",

"Hot sectors for M&A.",

"Regulatory environment for M&A (antitrust scrutiny)."

]

}

]

},

{

"section_id": "key_themes_risks",

"section_title": "Overarching Themes, Risks, and Opportunities",

"instructions": "Synthesize the analysis into key actionable themes, identify major risks, and highlight potential opportunities.",

"key_considerations": [

"Identify 3-5 major secular and cyclical themes shaping the markets (e.g., AI adoption, deglobalization, energy transition, demographic shifts).",

"Summarize key downside risks (e.g., policy missteps, geopolitical escalation, financial contagion, climate events). Provide potential mitigation strategies if applicable.",

"Highlight specific areas of opportunity for investors across asset classes or sectors.",

"Discuss the impact of ESG (Environmental, Social, Governance) factors on credit and capital markets."

]

},

{

"section_id": "conclusion_recommendations",

"section_title": "Conclusion and Strategic Recommendations",

"instructions": "Provide a concluding summary and offer high-level strategic recommendations for different investor profiles (e.g., conservative, balanced, aggressive).",

"key_considerations": [

"Summarize the overall outlook for credit and capital markets.",

"Suggest portfolio allocation considerations based on the identified trends and risks.",

"Offer specific actionable insights where possible."

]

}

],

"data_visualization_suggestions": [

"Charts for historical and forecasted credit spreads (IG & HY).",

"Graphs showing default rate trends and forecasts.",

"Heatmap of sector performance/risk in credit markets.",

"Chart of IPO issuance volume over time.",

"Visual representation of M&A activity trends.",

"Scenario analysis charts for key risk factors."

],

"expert_guidance_notes": [

"Ensure a balanced perspective, acknowledging both positive and negative factors.",

"Use quantitative data where possible to support qualitative analysis (cite sources if generating for internal use).",

"Clearly define any financial jargon or technical terms used.",

"The report should be forward-looking, focusing on expectations for the next 6-12 months, but can draw on recent historical context.",

"Consider interconnections between different market segments (e.g., how private credit growth impacts public debt markets)."

]

}
