{
  "title": "Case Study: Comprehensive Analysis of a Public Company",
  "source": "./AI_and_Coding/GenAI_Curriculum/05_Interactive_Case_Studies/01_Case_Study_Comprehensive_Company_Analysis.md",
  "tree": {
    "text": "Root",
    "children": [
      {
        "text": "**Innovate Corp. 10-K Report (latest fiscal year)**",
        "children": []
      },
      {
        "text": "**Innovate Corp. 10-Q Report (latest quarter)**",
        "children": []
      },
      {
        "text": "**Tech Sector Industry Report (latest edition)**",
        "children": []
      },
      {
        "text": "**Transcript of Innovate Corp.'s latest earnings call**",
        "children": []
      },
      {
        "text": "**Goal:** Create a concise summary of the company's business model, products, and competitive position.",
        "children": []
      },
      {
        "text": "**Prompting Technique:** Basic prompting, but with a specific persona and audience.",
        "children": []
      },
      {
        "text": "**Example Prompt Hint:** \"Act as a credit analyst preparing a summary for a loan committee. Using the attached 10-K, generate a 'Company Overview' section for Innovate Corp., focusing on its revenue streams and key competitive advantages as described in the 'Business' and 'Management's Discussion and Analysis' sections.\"",
        "children": []
      },
      {
        "text": "**Goal:** Identify the company's Strengths, Weaknesses, Opportunities, and Threats.",
        "children": []
      },
      {
        "text": "**Prompting Technique:** Chain-of-Thought (CoT) combined with multi-document synthesis.",
        "children": []
      },
      {
        "text": "**Example Prompt Hint:** \"Perform a SWOT analysis for Innovate Corp. First, analyze the 10-K and earnings call transcript to identify internal Strengths and Weaknesses. Second, analyze the Industry Report to identify external Opportunities and Threats. Synthesize this information into a four-quadrant SWOT analysis. Present the final output as a markdown table.\"",
        "children": []
      },
      {
        "text": "**Goal:** Generate a detailed analysis of the company's recent financial performance and calculate key credit ratios.",
        "children": []
      },
      {
        "text": "**Prompting Technique:** Few-Shot Prompting to ensure consistent output format for ratios.",
        "children": []
      },
      {
        "text": "**Example Prompt Hint:** \"Analyze the financial statements in the 10-K and 10-Q. Generate a narrative summarizing revenue trends, profitability, and cash flow. Then, calculate the following ratios for the last two fiscal years: Debt-to-EBITDA, Interest Coverage Ratio, and Current Ratio. Present the ratios in a table. Example: | Ratio | FY2023 | FY2024 | |---|---|---| | Debt-to-EBITDA | 2.5x | 2.8x |\"",
        "children": []
      },
      {
        "text": "**Goal:** Based on your analysis, generate a list of insightful questions to ask Innovate Corp.'s management team.",
        "children": []
      },
      {
        "text": "**Prompting Technique:** Tree of Thoughts (conceptual). The AI should explore different areas of concern to generate questions.",
        "children": []
      },
      {
        "text": "**Example Prompt Hint:** \"Based on the attached financial reports and risk factors, act as a skeptical credit analyst and generate a list of 5 key questions for the management of Innovate Corp. The questions should focus on potential weaknesses or inconsistencies in their financial reporting and strategic outlook. For each question, provide a brief rationale for why it is important to ask.\"",
        "children": []
      }
    ]
  }
}
