{
  "title": "LME Case Study: The Restructuring of Acme Corp.",
  "source": "./legal_analysis/miscellaneous_credit_analysis_topics/lme_strategies_and_case_studies/acme_corp_restructuring_case_study.md",
  "tree": {
    "text": "Root",
    "children": [
      {
        "text": "**Acme Corp.:** The borrower.",
        "children": []
      },
      {
        "text": "**First Lien Lenders:** A syndicate of banks holding senior secured debt.",
        "children": []
      },
      {
        "text": "**Bondholders:** A group of institutional investors holding unsecured bonds.",
        "children": []
      },
      {
        "text": "**New Money Investors:** A private equity firm willing to inject new capital in exchange for control.",
        "children": []
      },
      {
        "text": "**\"Prime\" the Existing Debt:** The New Money Investors would provide a new super-senior loan that would have priority over all existing debt.",
        "children": []
      },
      {
        "text": "**Exchange Offer:** The First Lien Lenders would be offered the opportunity to exchange their existing debt for new debt with a lower principal amount but a higher interest rate.",
        "children": []
      },
      {
        "text": "**Equity Conversion:** The Bondholders would have their debt converted into a small amount of equity in the reorganized company.",
        "children": []
      },
      {
        "text": "**First Lien Lenders' Argument:** They argued that the transaction violated the \"sacred rights\" in their credit agreement, which required unanimous consent for any action that would subordinate their claims.",
        "children": []
      },
      {
        "text": "**Bondholders' Argument:** They argued that the transaction was a fraudulent conveyance designed to benefit the New Money Investors at their expense.",
        "children": []
      },
      {
        "text": "**Company's Argument:** The company and the New Money Investors argued that the transaction was permissible under the terms of the credit agreement and was necessary to save the company from bankruptcy.",
        "children": []
      },
      {
        "text": "A smaller super-senior loan than originally proposed.",
        "children": []
      },
      {
        "text": "A more favorable exchange offer for the First Lien Lenders.",
        "children": []
      },
      {
        "text": "A larger equity stake for the Bondholders.",
        "children": []
      },
      {
        "text": "**The Importance of Document Analysis:** A deep understanding of credit agreements is crucial for identifying potential vulnerabilities and opportunities.",
        "children": []
      },
      {
        "text": "**Inter-creditor Dynamics:** Restructuring negotiations are often a multi-sided battle where different creditor groups have competing interests.",
        "children": []
      },
      {
        "text": "**The Rise of \"Creditor-on-Creditor\" Violence:** Sophisticated investors are increasingly using aggressive tactics to improve their position in a restructuring.",
        "children": []
      },
      {
        "text": "[Liability Management Exercises (LMEs)](link-to-be-added)",
        "children": []
      },
      {
        "text": "[Fraudulent Conveyance Law](link-to-be-added)",
        "children": []
      }
    ]
  }
}
