{
  "title": "Prompt Library: Industry Framework and Trend Analysis",
  "source": "./AI_and_Coding/Prompt_Libraries/Industry_Analysis/Framework_and_Trend_Analysis.md",
  "tree": {
    "text": "Root",
    "children": [
      {
        "text": "\"What is the primary industry in which [Company Name] operates? Provide the relevant NAICS or GICS code.\"",
        "children": []
      },
      {
        "text": "\"Summarize the key trends affecting the [Industry Name] industry over the last three years. (e.g., technological changes, consumer behavior shifts, regulatory updates).\"",
        "children": []
      },
      {
        "text": "\"What is the current size and projected growth rate of the [Industry Name] market?\"",
        "children": []
      },
      {
        "text": "\"Identify the key drivers of growth for this industry.\"",
        "children": []
      },
      {
        "text": "\"List the key government regulations that impact companies in the [Industry Name] industry.\"",
        "children": []
      },
      {
        "text": "\"Are there any significant environmental or social factors that are particularly relevant for this industry?\"",
        "children": []
      },
      {
        "text": "\"Conduct a Porter's Five Forces analysis for the [Industry Name] industry. For each of the five forces (Threat of New Entrants, Bargaining Power of Buyers, Bargaining Power of Suppliers, Threat of Substitute Products or Services, and Intensity of Rivalry), assess whether the force is high, medium, or low, and provide a brief justification.\"",
        "children": []
      },
      {
        "text": "\"Based on the Five Forces analysis, how attractive is the [Industry Name] industry from a profitability perspective?\"",
        "children": []
      },
      {
        "text": "\"Which of the five forces has the most significant impact on the industry's profitability and risk?\"",
        "children": []
      },
      {
        "text": "\"At what stage of the industry lifecycle is the [Industry Name] industry? (e.g., introduction, growth, maturity, decline). Justify your answer.\"",
        "children": []
      },
      {
        "text": "\"How cyclical is the [Industry Name] industry? How does it typically perform during economic expansions and recessions?\"",
        "children": []
      },
      {
        "text": "\"Analyze the key long-term secular trends (e.g., demographic shifts, decarbonization) that could reshape this industry over the next decade.\"",
        "children": []
      },
      {
        "text": "\"Perform a PESTLE (Political, Economic, Social, Technological, Legal, Environmental) analysis for the [Industry Name] industry. Identify the most critical factors that could impact companies operating in this space.\"",
        "children": []
      },
      {
        "text": "\"Analyze the value chain for the [Industry Name] industry. Where are the largest pools of profit and what are the key chokepoints?\"",
        "children": []
      },
      {
        "text": "\"What are the key success factors (KSFs) for a company to be a long-term winner in the [Industry Name] industry?\"",
        "children": []
      },
      {
        "text": "\"Evaluate the pace and nature of innovation in this industry. Is it incremental or disruptive? Who are the key innovators?\"",
        "children": []
      },
      {
        "text": "\"Develop three plausible scenarios for the future of the [Industry Name] industry over the next five years: a base case, a bull case, and a bear case. What are the key assumptions and signposts for each scenario?\"",
        "children": []
      },
      {
        "text": "\"How might a 'black swan' event (e.g., a sudden geopolitical crisis, a pandemic) specifically impact the supply and demand dynamics of this industry?\"",
        "children": []
      },
      {
        "text": "\"Forecast the impact of emerging technologies (e.g., AI, blockchain) on the competitive landscape and business models within this industry.\"",
        "children": []
      }
    ]
  }
}
